app/views/api/playlists/_playlist.json.jbuilder

json.tracks do
  playlist.tracks.each do |track|
---
SELECT "tracks".* FROM "tracks" INNER JOIN "playlist_tracks" ON "tracks"."id" = "playlist_tracks"."track_id" WHERE "playlist_tracks"."playlist_id" = $1  [["playlist_id", 2]]