app/controllers/api/albums_controller.rb

  def index

    if params[:order] == 'recent'
      @albums = Album.new_releases.includes(:tracks, :artist)
---
SELECT "albums".* FROM "albums"
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" IN (21, 22, 23, 24, 25, 26, 27, 28, 29, 30)

  def show
    @album = Album.includes(:artist, tracks: [:artist]).find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]