app/controllers/api/playlists_controller.rb

SELECT "playlists".* FROM "playlists" WHERE ('Hip-Hop' IN 'genres')
SELECT "playlists".* FROM "playlists"
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" IN (127, 256, 185, 254, 241, 255, 178, 194, 132, 179, 169, 180, 240, 244, 184, 189, 196, 190, 238, 235, 237, 239, 225, 236, 234, 233, 229, 227, 176, 177, 197, 230, 195, 188, 228, 186, 175, 174, 232, 170, 251, 192, 129, 250, 249, 252, 253, 193, 123, 147, 154, 142, 149, 159, 167, 168, 206, 165, 166, 199, 198, 143, 162, 151, 156, 144, 157, 155, 146, 150, 160, 163)
---
  def index
    # debugger
    playlists = (is_featured ? Playlist.featured : Playlist.user_playlists(current_user))

    if params[:genreId]
      playlists = Genre.find(params[:genreId]).playlists
    end

    @playlists = playlists.includes(:tracks)

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @playlist = Playlist.find(params[:id])