app/controllers/api/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    if params[:playlistId]
      @tracks = Playlist.find(params[:playlistId]).tracks.includes(:album)
    else
      @tracks = Track.includes(:album).all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 150], ["LIMIT", 1]]
---
  def show
    @track = Track.find(params[:id])