app/views/api/genres/_genre.json.jbuilder

SELECT "tracks".* FROM "tracks" INNER JOIN "albums" ON "tracks"."album_id" = "albums"."id" INNER JOIN "artists" ON "albums"."artist_id" = "artists"."id" INNER JOIN "genre_taggings" ON "artists"."id" = "genre_taggings"."artist_id" WHERE "genre_taggings"."genre_id" = $1  [["genre_id", 276]]
---
json.extract! genre, :id, :name
json.trackIds genre.tracks.map(&:id)