app/views/api/albums/_album.json.jbuilder

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" IN (21, 22, 23, 24, 25, 26, 27, 28, 29, 30)
---
json.artwork_url asset_path(album.artwork.url)
json.trackIds album.tracks.map(&:id)